**** Options

The option map let you stay what you want to do with your score.

- =:midi true=
  Write the score as MIDI file.
  Default to false.

- =:bpm <number>=
  Set the tempo to <number> beats per minute.
  Default value is 60.

- =:play true=
  Play the score.
  Default to false.

- =:filename <path>=
  Setting the name and location of emitted files.
  File extensions will be appended to this filename.

- =:tracks {<track-idx> <sequencer> ...}=
  Set each track idxs to a =javax.sound.midi.Sequencer=
  This library comes with 4 nice soundfonts that sounds way better than builtin one (=:default=):
  1. =:squid=
  2. =:chorium=
  3. =:fluid=
  4. =:airfont=

example:

#+begin_src clojure
(noon {:play true
       :tracks {0 :chorium}} ;; try to change soundfont here

      ;; this will be explained later
      ;; it repeats an ascending scale with different patches
      ;; in order to demonstrate the soundfont
      (mk dur2
          (rup 8 d1)
          (lin (patch :clarinet)
               (patch :electric-piano-1)
               (patch :trumpet)
               (patch :ocarina))))
#+end_src

#+RESULTS:
: {:source-file "generated/1733903842560.noon", :seed-file "generated/1733903842560.seed"}

In addition to those soundfonts, you can send the output of noon to any output device available on your machine.

#+begin_src clojure
(require 'noon.midi)
;; retrieve a device by name
(def bus1 (noon.midi/get-output-device "Bus 1"))
;; build a sequencer from it
(def bus1-sequencer (noon.midi/init-device-sequencer bus1))
;; use it to play a score
(noon {:play true
       :tracks {0 bus1-sequencer}}
      (mk (par s0 s1 s2)))
#+end_src

